Repository: NeuroAssassin/sky-cogs
Catalog: skytime/locales/*.po
Languages: fr

source: Timezone conversion tools
fr: Outils de conversion de fuseaux horaires

source: Alias List
fr: Liste d'alias

source: No aliases to be listed.
fr: Aucun alias à lister.

source: :x: Invalid command. Usage: `{prefix}time <time> <timezone1> [timezone2]` Where *time* is *now* or a timestamp of format 0am or 00:00 and *timezone* is the name of a tz timezone. If timezone2 is omitted, it will only respond to *now* requests.
fr: :x: Commande invalide. Utilisation: `{prefix}time <time> <timezone1> [timezone2]` Où *time* est *now* pour maintenant ou un temps au format 0am ou 00:00 et *timezone* est le nom d'un fuseau horaire tz. Si timezone2 est omis, seul les requêtes *now* seront répondues.

source: For a list of timezones: <https://en.wikipedia.org/wiki/List_of_tz_database_time_zones>
fr: Pour une liste complète de fuseaux horaires tz: <https://en.wikipedia.org/wiki/List_of_tz_database_time_zones>

source: :x: Invalid __source__ timezone.
fr: :x: Fuseau horaire __source__ invalide.

source: :x: Invalid __destination__ timezone.
fr: :x: Fuseau horaire __destination__ invalide.

source: :x: The timezone doesn't exist.
fr: :x: Le fuseau horaire n'existe pas.

source: It is {hsource} in **{csource}** right now.
fr: Il est {hsource} à **{csource}** en ce moment.

source: :white_check_mark: Added alias *{alias}* refering to {zone}.
fr: :white_check_mark: L'alias *{alias}* qui réfère à {zone} a été ajouté.

source: :x: A timezone already has this name. Consider changing your alias' name.
fr: :x: Un fuseau horaire existe déjà avec ce nom. Veuillez changer le nom de votre alias.

source: :x: The alias already exists. Consider removing it before re-adding it.
fr: :x: Cet alias existe déjà. Veuillez l'enlever avant de le réajouter.

source: :x: There cannot be spaces in aliases and timezones.
fr: :x: Il ne peut pas y avoir d'espaces dans le nom de l'alias ou le fuseau horaire.

source: :white_check_mark: Removed alias *{alias}*.
fr: :white_check_mark: L'alias *{alias}* a été retiré.

source: :x: Cannot remove alias *{alias}* because it doesn't exist.
fr: :x: Impossible d'enlever l'alias *{alias}* car il n'existe pas.

source: {hsource} in **{csource}** is equal to {hdest} in **{cdest}** ({tdiff[0]:+d}:{tdiff[1]:0>2})
fr: {hsource} à **{csource}** est équivalent à {hdest} à **{cdest}** ({tdiff[0]:+d}:{tdiff[1]:0>2})

source: :x: Invalid time format. Use now, 0am or 00:00.
fr: :x: Format de temps invalide. Utilisez now, 0am ou 00:00.

source: :x: Invalid time. How do you have more than 24h in your day?
fr: :x: Temps invalide. Comment pouvez vous avoir plus de 24 heures dans votre journée?

source: Convert the time from timezone1 to timezone2 List of supported timezones: <https://en.wikipedia.org/wiki/List_of_tz_database_time_zones>. The timezones must be the last part of the TZ column. For example, you would check the time in 'Africa/Abidjan' by doing `[p]time now Abidjan`
fr: Convertis le temps du fuseau horaire timezone1 à timezone2 Liste de fuseaux horaires supportés: <https://en.wikipedia.org/wiki/List_of_tz_database_time_zones>. Les 'timezone's doivent être la dernière partie de la colonne TZ. Par exemple, pour trouver le temps dans 'Africa/Abidjan' faites `[p]time now Abidjan`

source: Print the link to the list of possible timezones
fr: Affiches la liste de tous les fuseaux horaires supportés

source: Manage the timezone aliases
fr: Gères les alias de fuseaux horaires

source: Add a new timezone alias For example, with an alias named 'PST' pointing timezone 'GMT+8', you would do: `[p]time now PST` and it would be the same as `[p]time now GMT+8`
fr: Ajoutes un nouvel alias de fuseau horaire Par exemple, avec un alias nommé 'PST' qui pointe vers 'GMT+8', vous pouvez faire: `[p]time now PST` et cela sera pareil que `[p]time now GMT+8`

source: Delete a timezone alias
fr: Retires un alias de fuseau horaire

source: List all timezone aliases
fr: Listes tous les alias de fuseau horaire
